# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv', sep=',')

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = df

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis=1)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.Gender.value_counts()

# There are more female names

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [11]:
names = baby_names.groupby('Name').sum()
names = names.sort_values("Count", ascending=False)
names = names.drop(['Year', 'Gender', 'State'], axis=1)
names

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [14]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [15]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [19]:
# least occurrences = same count as min count
least_count_names = names[names.Count == names.Count.min()]
least_count_names = least_count_names.sort_values(by='Name')
least_count_names

          Count
Name
Aadarsh       5
Aadin         5
Aaima         5
Aalaya        5
Aaminah       5
...         ...
Zyien         5
Zyire         5
Zykeriah      5
Zykierra      5
Zymari        5

[2578 rows x 1 columns]

In [22]:
len(least_count_names)

2578

### Step 11. What is the median name occurrence?

In [21]:
median_count_names = names[names.Count == names.Count.median()]
median_count_names = median_count_names.sort_values(by='Name')
median_count_names

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

In [23]:
len(median_count_names)

66

### Step 12. What is the standard deviation of names?

In [24]:
names.Count.std()

np.float64(11006.06946789057)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [25]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000